cf/Catalogs/ПравилаОбменаСЭкселем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ПравилаОбменаСЭкселем</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗагрузки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЗагрузок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальнаяСтрока</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛистЭкселя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеСоздавать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗагружаемыеСтроки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерКолонки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>80</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоРеквизитПоиска</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочноеСоответствие</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выражение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизитаПоискаСсылки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>80</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерГруппировкиСтрок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеДобавлятьЕслиТакойЕсть</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Catalogs/ПравилаОбменаСЭкселем/Forms/ФормаЭлемента/Ext/Form/Module.bsl
Функция ПолучитьТекстПомощиРедактированияВыражения()
	
	Возврат "
	| Объект 		- загружаемый новый объект
	| ТекстЭкселя 	- текст в колонке экселя
	| Изменился		- булево, если изменился тогда объект будет записан
	| стрОшибки 	- текст который рекомендуеться заполнить если произойдет ошибка
	| ТаблицаДанных	- таблица значений со всеми данными экселя по строке:
	|		- ИмяРеквизита
	|		- Выражение
	|		- ТекстВЯчейке
	|		- ЭтоРеквизитПоиска
	|		- ТипОбъекта
	|		- ИмяРеквизитаПоискаСсылки
	|		- НомерГруппировкиСтрок
	|		- НеДобавлятьЕслиТакойЕсть
	|		- НомерКолонки
	|";
	
КонецФункции

&НаКлиенте
Процедура ОписаниеСтрокТипОбъектаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОтборМетаданных = Новый СписокЗначений;
	ОтборМетаданных.Добавить("Справочники");
	
	ДанныеВыбора = ОткрытьФорму("ОбщаяФорма.ВыборОбъектовМетаданных", 
	                  Новый Структура("ВыбранныеМетаданные, УникальныйИдентификаторИсточник", ОтборМетаданных , УникальныйИдентификатор));
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОбъектаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОтборМетаданных = Новый СписокЗначений;
	ОтборМетаданных.Добавить("Справочники");
	ОтборМетаданных.Добавить("Документы");
	ОтборМетаданных.Добавить("РегистрыСведений");
	
	ОткрытьФорму("ОбщаяФорма.ВыборОбъектовМетаданных", 
	                  Новый Структура("ВыбранныеМетаданные, УникальныйИдентификаторИсточник", ОтборМетаданных , УникальныйИдентификатор), Элемент);
		
КонецПроцедуры

&НаКлиенте
Процедура ВидОбъектаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если 	ТипЗнч(ВыбранноеЗначение) = Тип("СписокЗначений") И
			ВыбранноеЗначение.Количество() Тогда
			
		Объект.ВидОбъекта = ВыбранноеЗначение[0].Значение;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДВ = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДВ.Фильтр =  "Эксель (*.xls)|*.xls*";	
	
	Если ДВ.Выбрать() Тогда
		
		Объект.ИмяФайла = ДВ.ПолноеИмяФайла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСтруктуру(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ВыражениеОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.ОписаниеСтрок.ТекущиеДанные;
	
	ОткрытьФорму("ОбщаяФорма.РедактированияВыражения", 
	                  Новый Структура("Выражение, ТекстПомощи", 
					  	 ТекДанные.Выражение, 
						 ПолучитьТекстПомощиРедактированияВыражения()), 
					Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ВыражениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если 	ТипЗнч(ВыбранноеЗначение) = Тип("Строка") Тогда
		
		ТекДанные = Элементы.ОписаниеСтрок.ТекущиеДанные;
		ТекДанные.Выражение = ВыбранноеЗначение;
		
	КонецЕсли;

КонецПроцедуры
